{# 
Задача 2(**): 

Почитайте сколько всего полетов (количество строк в модели fct_flights) было запланировано за предыдущие 10 лет, 
начиная с текущей даты (scheduled_departure between [текущая дата] and [дата на 10 лет раньше текущей]).

Создайте analyses под названием flights_last_ten_years с расчетом. Опубликуйте его в github и приложите ссылку.

Подсказки:

- Текущую дату и время в jinja можно получить так: {{ run_started_at }}
- Дату со временем можно преобразовать к строке с помощью фильтра string
- Получить первые 10 символов строки в jinja можно с помощью фильтра truncate(10, True, "")

Подсказка алгоритма:

- Задайте переменную current_date, в которую поместите значение текущей даты в строковом формате;
- Задайте переменную current_year, в которую поместите значение текущего года в формате int;
- Задайте переменную prev_year, в которую поместите значение года, который был 10 лет назад, в формате int;
- Задайте переменную prev_date, в которую поместите значение даты, которая была 10 лет назад, в строковом формате;

Сделайте запрос с группировкой из модели fct_flights, с подсчетом количества строк и фильтрацией по полю scheduled_departure, 
чтобы оно было между текущей датой и датой 10 лет назад от текущей.
#}

{% set curr_dt = "{{ run_started_at | string | truncate(10, True, '') }}" %}

select count(*) as flights_count
from {{ ref('fct_flights') }}
where scheduled_departure between '{{ curr_dt }}'::date - interval '10' year and '{{ curr_dt }}'
